<?php 
umask(0);
require 'app/Mage.php';
Mage::app()->setCurrentStore(Mage_Core_Model_App::ADMIN_STORE_ID);

$conn = mysql_connect('localhost' , 'root' , '');

if($conn);
{
	//connect to database
	 $q = 'use asai';
	mysql_query($q , $conn);
	mysql_set_charset('utf8',$conn);

	function getprid($name){
		$model = Mage::getModel('catalog/product'); //getting product model
		$model = Mage::getModel('catalog/product')->loadByAttribute('name', $name);
		$id = $model->getId();
		return $id;
	}
	function replace_name_id($array){

		$array_id = array();
			foreach ($array as $key) {
			  foreach ($key as $value => &$val) {
				    $key[$value] = getprid($val);
			  }
			  array_push($array_id , $key);
			}
	  return $array_id;
	} 
    function convert($array){
		   $converted=array();
		    foreach ($array as $key ) {
		      for ($j=0; $j< count($key) ; $j++) { 
		          for ($i=$j+1; $i< count($key) ; $i++) { 
		        	array_push($converted, [ $key[$j] , $key[$i] ]);
		         }
		         for ($i=$j; $i > 0 ; $i--) { 
		         	array_push($converted, [ $key[$j] , $key[$i-1] ]);
		         }
		      }
		   }
	       return $converted;
    }
	function insert($c , $array){

			 foreach ($array as $key) {
			    //query of all products relation
			    if ($key[0] != $key[1]) {
			    	$q ="INSERT INTO `catalog_product_link` (`link_id`, `product_id`, `linked_product_id`, `link_type_id`) VALUES (NULL, '".$key[0]."', '".$key[1]."', '4');";
			    	$result = mysql_query($q , $c);
					    
				 if (!$result) {
					  die('Could not query:' . mysql_error());
				 }	    
			    }
				

				 
			 }
	}
   function duplicate($array){
          $results = array();

			foreach ($array as $k => $v) {
			  $results[implode($v)] = $v;
			}

			$results = array_values($results);
			return $results;
   }
	

	$array_id = [['کوسن کد 104','کوسن کد 109','کوسن کد102','کوسن کد 107','کوسن کد 118','کوسن کد111','کوسن کد103','قاب موبایل  دستساز چرم و طلا '],['عروسک فرشته','مجسمه پارچه ای ولنتاین','آویز عروسک خاله سوسکه'],['دستبند چرم فروهر','دستبند چرم فروهر','دستبند چرمی  دستساز مردانه طرح آویز','دستبند چرمی دستساز مردانه ','دستبند چرمی فروهر ','دستبند چرم فروهر ','دستبند چرم با طرح اسکلت','دستبند چرم مردانه '],['دستبند چرم مردانه ','دستبند چرم فروهر','دستبند چرمی  دستساز مردانه طرح آویز','دستبند چرمی دستساز مردانه ','دستبند چرمی فروهر ','دستبند چرم فروهر ','دستبند چرم با طرح اسکلت','دستبند چرم فروهر'],['انگشتر برنجی طرح گل و مرغ','انگشتر سه تکه ','انگشتر طرح هشت پر ','انگشتر طرح بهاره قاصدک','انگشتر برنجی طرح کاشی'],['دستبند چرم مردانه ','دستبند چرم فروهر','دستبند چرمی دستساز مردانه ','دستبند چرمی فروهر ','دستبند چرم فروهر ','دستبند چرم با طرح اسکلت','دستبند چرمی  دستساز مردانه طرح آویز'],['انگشتر سه تکه ','انگشتر طرح بهاره قاصدک','انگشتر برنجی طرح گل و مرغ','انگشتر برنجی طرح کاشی','انگشتر طرح هشت پر ','انگشتر برنجی _گل و مرغ مشکی'],['دستبند چرم مردانه ','دستبند چرم فروهر','دستبند چرمی  دستساز مردانه طرح آویز','دستبند چرمی فروهر ','دستبند چرم فروهر ','دستبند چرم با طرح اسکلت','دستبند چرمی دستساز مردانه '],['گردنبند کاشی و پرنده ','گردنبند با طرح لباس سنتی','گردنبند برنجی طرح لباس گلدار'],['دستبند چرم مردانه ','دستبند چرم فروهر','دستبند چرمی  دستساز مردانه طرح آویز','دستبند چرمی دستساز مردانه ','دستبند چرم فروهر ','دستبند چرم با طرح اسکلت','دستبند چرمی فروهر '],['دستبند چرم فروهر','دستبند چرم فروهر','دستبند چرمی  دستساز مردانه طرح آویز','دستبند چرمی دستساز مردانه ','دستبند چرمی فروهر ','دستبند چرم با طرح اسکلت','دستبند چرم فروهر '],['دستبند چرم مردانه ','دستبند چرم فروهر','دستبند چرم فروهر','دستبند چرمی  دستساز مردانه طرح آویز','دستبند چرمی دستساز مردانه ','دستبند چرمی فروهر ','دستبند چرم فروهر ','دستبند چرم با طرح اسکلت'],['کوسن کد 104','کوسن کد 109','کوسن کد102','کوسن کد 107','کوسن کد 118','کوسن کد111','کوسن کد103','کوسن کاشی ','کوسن قجری'],['کوسن کد 104','کوسن کد 109','کوسن کد102','کوسن کد 107','کوسن کد 118','کوسن کد111','کوسن کد103','کوسن قجری','کوسن کاشی '],['کوسن کد 104','کوسن کد 109','کوسن کد102','کوسن کد 107','کوسن کد 118','کوسن کد111','کوسن کد103','کوسن قجری','کوسن کاشی ','کوسن طرح قجری_2'],['آویز عروسک خاله سوسکه','مجسمه پارچه ای ولنتاین','مجسمه پارچه ای فرشته مو بنفش ','مجسمه پارچه ای مو سفید','مجسمه پارچه ای عشق','عروسک فرشته'],['آویز عروسک خاله سوسکه','عروسک فرشته','مجسمه پارچه ای فرشته مو بنفش ','مجسمه پارچه ای مو سفید','مجسمه پارچه ای عشق','مجسمه پارچه ای ولنتاین'],['عروسک فرشته','مجسمه پارچه ای ولنتاین','مجسمه پارچه ای مو سفید','مجسمه پارچه ای عشق','مجسمه پارچه ای فرشته مو بنفش '],['عروسک فرشته','مجسمه پارچه ای ولنتاین','مجسمه پارچه ای فرشته مو بنفش ','مجسمه پارچه ای عشق','مجسمه پارچه ای مو سفید'],['عروسک فرشته','مجسمه پارچه ای ولنتاین','مجسمه پارچه ای فرشته مو بنفش ','مجسمه پارچه ای مو سفید','مجسمه پارچه ای عشق'],['جعبه هدیه چوبی ','قاب موبایل  دستساز چرم و طلا ','روان نویس برجسته هخامنشی '],['آویز عروسک خاله سوسکه','عروسک فرشته','مجسمه پارچه ای ولنتاین','مجسمه پارچه ای فرشته مو بنفش ','مجسمه پارچه ای مو سفید','مجسمه پارچه ای عشق','مجسمه پارچه ای ماهی'],['کاسه فیروزه ای ','کاسه سرامیکی سنتی '],['دستبند عقیق رنگی ','دستبند عقیق آبی '],['دستبند عقیق رنگی ','دستبند چرم با نشان ماه تولد ','دستبند انیکس'],['گوشواره تبتی','دستبند عقیق رنگی ','دستبند انیکس','دستبند مهره ای '],['  دستبند چرم آويزي مردانه ','دستبند چرم مردانه ','دستبند چرم فروهر','دستبند چرمی  دستساز مردانه طرح آویز','دستبند چرمی فروهر ','دستبند چرم فروهر ','دستبند چرم با طرح اسکلت','دستبند مهره ای ','ست دستبند مهره ای مردانه '],['دستبند عقیق رنگی ','دستبند انیکس','ست دستبد مهره ای ','دستبند عقیق قرمز'],['دستبند عقیق رنگی ','دستبند انیکس','ست دستبد مهره ای ','دستبند عقیق قرمز','دستبند عقيق آگات'],['گوشواره تبتی','گوشواره سنگ سبز با آویز نپالی'],['آپاژور 3D طرح بادبادک ','آباژور 3D طرح اسکلت ','آباژور 3D طرح مارپیچ'],['آپاژور 3D طرح بادبادک ','آباژور 3D طرح مارپیچ','آباژور 3D طرح اسکلت '],['آینه دستساز سایز بزرگ','آینه گلدار سایز بزرگ '],['آینه گلدار سایز بزرگ ','آینه دستساز گلدار سایز کوچک ','آینه دستساز گلدار لیمویی سایز کوچک','آینه دستساز سایز بزرگ'],['آینه گلدار سایز بزرگ ','آینه دستساز سایز بزرگ','آینه دستساز گلدار سایز کوچک '],['آینه گلدار سایز بزرگ ','آینه دستساز سایز بزرگ','آینه دستساز گلدار سایز کوچک ','آینه دستساز گلدار لیمویی سایز کوچک'],['پیاله سفالی روناس','کاسه سفالی بزرگ روناس','پیاله سفالی سنتی روناس'],['دستبند چرمی سنتی زنانه ','دستبند چرمی سنتی','دستبند سنتی چرم زنانه','دستبند چرم سنتی','دستبند سنتی چرمی زنانه'],['دستبند سنتی چرمی زنانه','دستبند چرمی سنتی','دستبند سنتی چرم زنانه','دستبند چرم سنتی','دستبند دستساز چرم زنانه','دستبند چرم زنانه','دستبند چرمی سنتی ','دستبند چرمی سنتی زنانه '],['دستبند سنتی چرمی زنانه','دستبند چرمی سنتی زنانه ','دستبند چرمی سنتی'],['دستبند سنتی چرمی زنانه','دستبند چرمی سنتی زنانه ','دستبند چرمی سنتی','دستبند سنتی چرم زنانه'],['دستبند سنتی چرمی زنانه','دستبند چرمی سنتی زنانه ','دستبند چرمی سنتی','دستبند سنتی چرم زنانه','دستبند چرم سنتی'],['دستبند سنتی چرمی زنانه','دستبند چرمی سنتی زنانه ','دستبند چرمی سنتی','دستبند سنتی چرم زنانه','دستبند سنتی چرم زنانه','دستبند دستساز چرم زنانه'],['دستبند سنتی چرمی زنانه','دستبند چرمی سنتی زنانه ','دستبند چرمی سنتی','دستبند سنتی چرم زنانه','دستبند چرم سنتی','دستبند دستساز چرم زنانه','دستبند چرم زنانه'],['دستبند سنتی چرمی زنانه','دستبند چرمی سنتی زنانه ','دستبند چرمی سنتی','دستبند سنتی چرم زنانه','دستبند چرم سنتی','دستبند دستساز چرم زنانه','دستبند چرم زنانه','دستبند چرمی سنتی '],['دستبند سنتی چرمی زنانه','دستبند چرمی سنتی زنانه ','دستبند چرمی سنتی','دستبند سنتی چرم زنانه','دستبند چرم سنتی','دستبند چرم زنانه','دستبند چرمی سنتی ','دستبند چرم دستساز زنانه '],['سررسید جیبی پارچه ای','سررسید جیبی پارچه ای '],['سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای'],['سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای '],['سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای '],['سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای '],['سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای ','سررسید جیبی پارچه ای '],['پیاله سفالی سنتی روناس','پیاله سفالی روناس'],['روان نویس برجسته هخامنشی ','دستبند سنتی چرمی زنانه','کاسه سفالی بزرگ روناس'],['روسری ساتن کد B11601','روسری ساتن کد B11604','شال کد A11603'],['کوسن کد 104','کوسن کد 109','کوسن کد102','کوسن کد 107','کوسن کد 118','کوسن کد111','کوسن کد103','کوسن طرح فرش '],['شال کد A11603','روسری ساتن کد B11601'],['کوسن طرح فرش ','کوسن طرح مینیاتور'],['شال کد A11603','روسری ساتن کد B11601','روسری ساتن کد B11604'],['شال کد A11603','روسری ساتن کد B11601','روسری ساتن کد B11604','روسری ساتن کد B11608'],['ماگ طرح سنتی','ماگ طرح سنتی ','ماگ سنتی '],['ماگ سنتی ','ماگ طرح سنتی'],['ماگ سنتی ','ماگ طرح سنتی','ماگ طرح سنتی '],['ماگ سنتی ','ماگ طرح سنتی','ماگ طرح سنتی ','ماگ سنتی '],['ماگ سنتی ','ماگ طرح سنتی','ماگ طرح سنتی ','ماگ سنتی ','ماگ طرح سنتی '],['شال کد A11603','روسری ساتن کد B11601','روسری ساتن کد B11604','روسری ساتن کد B11608','شال مینیاتور'],['شال کد A11603','روسری ساتن کد B11601','روسری ساتن کد B11604','روسری ساتن کد B11608','شال مینیاتور','شال نخی سنتی '],['کاسه سفالی بزرگ روناس','روسری ساتن کد B11601','روسری ساتن کد B11604','سرویس شاه عباسی فیروزه ای','شال مینیاتور',' شال نخی سنتی '],['ماگ سنتی ','ماگ طرح سنتی','ماگ طرح سنتی ','ماگ سنتی ','ماگ طرح سنتی ','ماگ طرح سنتی '],['مرغ و خروس سنتی گلسرخی','ماگ love'],['ماگ love','ماگ سرامیکی ','ماگ سرامیکی '],['ماگ love','ماگ سرامیکی ','ماگ سرامیکی ','ماگ سرامیکی '],['ماگ love','ماگ سرامیکی ','ماگ سرامیکی ','ماگ سرامیکی '],['جا کلیدی','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','قاب دیواری'],['قاب دیواری','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','جا کلیدی'],['قاب دیواری','جا کلیدی','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','قاب دیوار کوب'],['قاب دیواری','قاب دیوار کوب','جا کلیدی','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','قاب دیوار کوب '],['قاب دیواری','جا کلیدی','قاب دیوار کوب','قاب دیوار کوب ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','اویز دیواری '],['قاب دیواری','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','جا کلیدی','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','آویز دیواری'],['قاب دیواری','جا کلیدی','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','آویز دیواری'],['گردنبند مرغ آمین ','گردنبند مرغ آمین '],['گردنبند مرغ آمین ','گردنبند مرغ آمین '],['گردنبند مرغ آمین ','گردنبند مرغ آمین ','گوشواره مرغ آمین '],['گردنبند مرغ آمین ','گردنبند مرغ آمین ','گوشواره مرغ آمین ','گوشواره مرغ آمین '],['قاب دیواری','جا کلیدی','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','قاب دیوارکوب '],['قاب دیواری','جا کلیدی','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','قاب دیوارکوب '],['قاب دیواری','جا کلیدی','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب ','قاب دیوار کوب '],['قاب دیواری','جا کلیدی','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب','قاب دیوارکوب '],['قاب دیواری','جا کلیدی','قاب دیوار کوب','قاب دیوار کوب ','اویز دیواری ','آویز دیواری','آویز دیواری','قاب دیوارکوب ','قاب دیوارکوب ','قاب دیوار کوب ','قاب دیوار کوب ','قاب دیوارکوب ','قاب دیوارکوب'],['گردنبند مرغ آمین ','گردنبند مرغ آمین ','گوشواره مرغ آمین ','گوشواره مرغ آمین ','دستبند طرح مرغ آمین '],['گوشواره مرغ آمین','گردنبند مرغ آمین','گردنبند و گوشواره مرغ آمین '],['ماگ طرح کاشی',' کیف پول چرمی کتی'],['کوسن طرح کاشی',' کیف پول جیبی چرمی'],['عروسک گنجشک','یراق آویز','کیف پول چرمی دست دوز']];
	 
	$array_id = replace_name_id($array_id);
    $array_id = convert($array_id);
    $array_id = duplicate($array_id);
    $array_id = insert($conn,$array_id);
     
    mysql_close($conn);
    echo "<h1 style='background:green;color:#fff;'>All Relation Recorded</h1>";
}

?>